#+TITLE: KubeCon CloudNativeCon template
#+SUBTITLE: My cool talk
#+AUTHOR: Cool humans

#+begin_notes
Welcome to TITLE

Introductions
#+end_notes

* doc notes                                                        :noexport:
ii @ KubeCon CloudNativeCon

CHECK THE TODOs

* About ii
#+begin_notes
- We are with ii, a group in NZ with a focus on cooperative coding.
- pairing is sharing for us
- you can find us at ii.nz
#+end_notes

Technical Folks in New Zealand
- Focus on Cooperative Coding
- Pairing is Sharing
- [[https://ii.nz][ii.nz]] / [[https://ii.coop][ii.coop]]

** People
#+begin_notes
Who is ii?
- Brenda, who makes ii function
- Caleb ...
- Hippie Hacker, founder of ii
- Riaan, project manager
- Stephen ...
- Zach, data wizard
#+end_notes

- Brenda Peel
- Caleb Woodbine
- Hippie Hacker
- Riaan Kleinhans
- Stephen Heywood
- Zach Mandeville

* Q&A
#+begin_notes
Thank you to those who attended the talk live and to those are watched later.
We hope to hear from you and hope that this talk helped you.

Now, let's move to some live Q&A!
#+end_notes

* LOCAL VARS :noexport:
 Local Variables:
 eval: (setenv "MULTIPLEX_URL" (or (getenv "MULTIPLEX_URL") "https://reveal-multiplex.glitch.me"))
 eval: (set-variable 'org-re-reveal-root (getenv "MULTIPLEX_URL"))
 eval: (set-variable 'org-re-reveal-multiplex-url (concat (getenv "MULTIPLEX_URL") "/"))
 eval: (set-variable 'org-re-reveal-multiplex-socketio-url (concat (getenv "MULTIPLEX_URL") "/socket.io/socket.io.js"))
 End:
#+REVEAL_MULTIPLEX_SECRET: 16303595814587938032
#+REVEAL_MULTIPLEX_ID: 1ea00b34ec29b2a6
#+REVEAL_VERSION: 4
#+NOREVEAL_DEFAULT_FRAG_STYLE: YY
#+REVEAL_EXTRA_CSS: ./ii-style.css
#+NOREVEAL_EXTRA_JS: YY
#+REVEAL_HLEVEL: 2
#+REVEAL_MARGIN: 0
#+REVEAL_WIDTH: 5000
#+REVEAL_HEIGHT: 800
#+REVEAL_MAX_SCALE: 0.9
#+REVEAL_MIN_SCALE: 0.2
#+REVEAL_PLUGINS: (markdown notes highlight multiplex)
#+REVEAL_SLIDE_NUMBER: ""
#+REVEAL_PROGRESS: f
#+REVEAL_SPEED: 1
#+REVEAL_THEME: night
#+REVEAL_THEME_OPTIONS: beige|black|blood|league|moon|night|serif|simple|sky|solarized|white
#+REVEAL_TRANS: fade
#+REVEAL_TRANS_OPTIONS: none|cube|fade|concave|convex|page|slide|zoom
#+REVEAL_TITLE_SLIDE: <h1>%t</h1>
#+REVEAL_TITLE_SLIDE: <h3>%s</h3>
#+REVEAL_TITLE_SLIDE: <p>%a</p>

#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: mathjax:Y
#+OPTIONS: reveal_single_file:nil
#+OPTIONS: reveal_control:t
#+OPTIONS: reveal_progress:nil
#+OPTIONS: reveal_history:nil
#+OPTIONS: reveal_center:t
#+OPTIONS: reveal_rolling_links:nil
#+OPTIONS: reveal_keyboard:t
#+OPTIONS: reveal_overview:t
#+OPTIONS: reveal_width:1200
#+OPTIONS: reveal_height:800
#+OPTIONS: reveal_fragmentinurl:t
#+OPTIONS: timestamp:nil
#+OPTIONS: reveal_title_slide:nil

* Set up :noexport:
Link up this folder to the web
#+begin_src shell :results silent
rm ~/public_html
ln -s $PWD ~/public_html
#+end_src

Generate a token
#+begin_src shell
curl -s ${MULTIPLEX_URL:-reveal-multiplex.glitch.me}/token | jq .
#+end_src

#+RESULTS:
#+begin_example
{
  "secret": "16303595814587938032",
  "socketId": "1ea00b34ec29b2a6"
}
#+end_example

Delete the Namespace
#+begin_src shell
kubectl delete ns kubecon-na-2021
#+end_src

#+RESULTS:
#+begin_example
#+end_example

Clear SnoopDB
#+begin_src shell
psql -U apisnoop -d apisnoop -h snoopdb.apisnoop -c "DELETE FROM testing.audit_event WHERE release='live';"
#+end_src

#+RESULTS:
#+begin_example
DELETE 7162
#+end_example
